content.org/posts/chapter01-introduction.org
# -*- mode: org -*-
#+HUGO_BASE_DIR: ../..
#+HUGO_SECTION: posts
#+HUGO_WEIGHT: 2000
#+HUGO_AUTO_SET_LASTMOD: t
#+TITLE: "Chapter 1: Introduction"
#+DATE: 2019-11-06T21:16:37-08:00
#+HUGO_TAGS: dlbook 
#+HUGO_CATEGORIES: dlbook 
#+HUGO_MENU_off: :menu "main" :weight 2000
#+HUGO_CUSTOM_FRONT_MATTER: :foo bar :baz zoo :alpha 1 :beta "two words" :gamma 10 :mathjax true
#+HUGO_DRAFT: false

#+STARTUP: indent hidestars showall
* introduction
- Deep learning solves the central problem in representation learning
- problem: find the right representation for data, e.g. polar vs rect
  coordinates
** Another perspective
- each layer in multilayer network represents
  - multi-steps in a computer program
  - each layer of representation is a state in a sequence of executions
  - greater depth implies more instructions in sequence
  - not all information in a layer's activation encodes factors of variation
    that explain the input!  Representation also store state information that
    helps to execute a program
* Depth of a model
1. number of sequential instructions
